In [4]:
import pandas as pd

In [5]:
a = pd.read_csv('dee.csv')
a

            Name  English  Hindi  Maths  Science  Social Science
0  Smriti Ranjan       85     83     93       91            94.0
1  Tannu kumari        90     75     78       73             NaN
2          Seema       93     75     78       89            94.0
3  Mukesh Nirmal       92     74     71       96            75.0
4  Mukesh Nirmal       92     74     71       96            75.0
5  Smriti Ranjan       85     83     93       91            94.0

In [6]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            6 non-null      object
 1   English         6 non-null      int64
 2   Hindi           6 non-null      int64
 3   Maths           6 non-null      int64
 4   Science         6 non-null      int64
 5   Social Science  5 non-null      float64
dtypes: float64(1), int64(4), object(1)
memory usage: 416.0+ bytes

In [7]:
a.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [8]:
a.drop_duplicates()

            Name  English  Hindi  Maths  Science  Social Science
0  Smriti Ranjan       85     83     93       91            94.0
1  Tannu kumari        90     75     78       73             NaN
2          Seema       93     75     78       89            94.0
3  Mukesh Nirmal       92     74     71       96            75.0

In [9]:
a

            Name  English  Hindi  Maths  Science  Social Science
0  Smriti Ranjan       85     83     93       91            94.0
1  Tannu kumari        90     75     78       73             NaN
2          Seema       93     75     78       89            94.0
3  Mukesh Nirmal       92     74     71       96            75.0
4  Mukesh Nirmal       92     74     71       96            75.0
5  Smriti Ranjan       85     83     93       91            94.0

In [10]:
a.drop_duplicates(inplace=True)

In [11]:
a

            Name  English  Hindi  Maths  Science  Social Science
0  Smriti Ranjan       85     83     93       91            94.0
1  Tannu kumari        90     75     78       73             NaN
2          Seema       93     75     78       89            94.0
3  Mukesh Nirmal       92     74     71       96            75.0

In [12]:
a.drop(columns='English', inplace=True)

In [13]:
a

            Name  Hindi  Maths  Science  Social Science
0  Smriti Ranjan     83     93       91            94.0
1  Tannu kumari      75     78       73             NaN
2          Seema     75     78       89            94.0
3  Mukesh Nirmal     74     71       96            75.0

In [35]:
#a['Name'].str.strip('..')
# a['Name'].str.lstrip('..')
a['Name'].str.rstrip('..')

0    Smriti Ranjan
1    Tannu kumari
2            Seema
3    Mukesh Nirmal
Name: Name, dtype: object

In [36]:
a.isnull()

    Name  Hindi  Maths  Science  Social Science  Total
0  False  False  False    False           False  False
1  False  False  False    False            True   True
2  False  False  False    False           False  False
3  False  False  False    False           False  False

In [ ]:
a.isnull().sum()

In [ ]:
a

In [ ]:
a.rename(columns={'Name':'Students'},inplace=True)

In [ ]:
a

In [ ]:
a['Total']=0

In [34]:
a

            Name  Hindi  Maths  Science  Social Science  Total
0  Smriti Ranjan     83     93       91            94.0  500.0
1  Tannu kumari      75     78       73             NaN    NaN
2          Seema     75     78       89            94.0  247.0
3  Mukesh Nirmal     74     71       96            75.0  220.0

In [16]:
a['Total']=a['Hindi']+a['Maths']+a['Social Science']

In [17]:
a

            Name  Hindi  Maths  Science  Social Science  Total
0  Smriti Ranjan     83     93       91            94.0  270.0
1  Tannu kumari      75     78       73             NaN    NaN
2          Seema     75     78       89            94.0  247.0
3  Mukesh Nirmal     74     71       96            75.0  220.0

In [40]:
a.describe()

           Hindi      Maths    Science  Social Science       Total
count   4.000000   4.000000   4.000000        3.000000    3.000000
mean   76.750000  80.000000  87.250000       87.666667  322.333333
std     4.193249   9.273618   9.945686       10.969655  154.454956
min    74.000000  71.000000  73.000000       75.000000  220.000000
25%    74.750000  76.250000  85.000000       84.500000  233.500000
50%    75.000000  78.000000  90.000000       94.000000  247.000000
75%    77.000000  81.750000  92.250000       94.000000  373.500000
max    83.000000  93.000000  96.000000       94.000000  500.000000

In [20]:
a['Hindi'].mean()

76.75

In [21]:
mean_h=a['Hindi'].mean()
median_h = a['Hindi'].median()
print(mean_h)
print(median_h)

76.75
75.0

In [22]:
mean_m=a['Maths'].mean()
median_m = a['Maths'].median()

print(mean_m)
print(median_m)

80.0
78.0

In [23]:
mean_s=a['Social Science'].mean()
median_s = a['Social Science'].median()

print(mean_s)
print(median_s)

87.66666666666667
94.0

In [24]:
mean_t=a['Total'].mean()
median_t=a['Total'].median()
print(mean_t)
print(median_t)

245.66666666666666
247.0

In [25]:
a['Hindi'].isnull().any()

False

In [26]:
a['Maths'].isnull().any()

False

In [27]:
a['Social Science'].isnull().any()

True

In [28]:
a

            Name  Hindi  Maths  Science  Social Science  Total
0  Smriti Ranjan     83     93       91            94.0  270.0
1  Tannu kumari      75     78       73             NaN    NaN
2          Seema     75     78       89            94.0  247.0
3  Mukesh Nirmal     74     71       96            75.0  220.0

In [29]:
#a['Social Science'].fillna(median_m=True)

In [30]:
a.replace(to_replace=270, value=500, inplace=True)

In [31]:
a

            Name  Hindi  Maths  Science  Social Science  Total
0  Smriti Ranjan     83     93       91            94.0  500.0
1  Tannu kumari      75     78       73             NaN    NaN
2          Seema     75     78       89            94.0  247.0
3  Mukesh Nirmal     74     71       96            75.0  220.0

In [32]:
a['Total'].describe()

count      3.000000
mean     322.333333
std      154.454956
min      220.000000
25%      233.500000
50%      247.000000
75%      373.500000
max      500.000000
Name: Total, dtype: float64

In [37]:
a['Social Science'].replace(to_replace='', value=99, inplace=True)

In [38]:
a

            Name  Hindi  Maths  Science  Social Science  Total
0  Smriti Ranjan     83     93       91            94.0  500.0
1  Tannu kumari      75     78       73             NaN    NaN
2          Seema     75     78       89            94.0  247.0
3  Mukesh Nirmal     74     71       96            75.0  220.0